k6-retest-baseline.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: tests/k6/scenario-baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 1m0s (gracefulStop: 30s)

time="2025-12-07T11:06:05Z" level=info msg="🔧 Setting up user pool..." source=console

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]
time="2025-12-07T11:06:09Z" level=info msg="✅ Loaded 50 male users" source=console
time="2025-12-07T11:06:10Z" level=info msg="✅ Loaded 50 female users" source=console

running (0m05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m00.4s/1m0s

running (0m06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m01.4s/1m0s

running (0m07.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m02.4s/1m0s

running (0m08.0s), 10/10 VUs, 4 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m03.4s/1m0s

running (0m09.0s), 10/10 VUs, 7 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m04.4s/1m0s

running (0m10.0s), 10/10 VUs, 13 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m05.4s/1m0s

running (0m11.0s), 10/10 VUs, 14 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m06.4s/1m0s

running (0m12.0s), 10/10 VUs, 18 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m07.4s/1m0s

running (0m13.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m08.4s/1m0s

running (0m14.0s), 10/10 VUs, 25 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m09.4s/1m0s

running (0m15.0s), 10/10 VUs, 28 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m10.4s/1m0s

running (0m16.0s), 10/10 VUs, 32 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m11.4s/1m0s

running (0m17.0s), 10/10 VUs, 36 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  0m12.4s/1m0s

running (0m18.0s), 10/10 VUs, 37 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m13.4s/1m0s

running (0m19.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  0m14.4s/1m0s

running (0m20.0s), 10/10 VUs, 45 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  0m15.4s/1m0s

running (0m21.0s), 10/10 VUs, 48 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m16.4s/1m0s

running (0m22.0s), 10/10 VUs, 52 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  0m17.4s/1m0s

running (0m23.0s), 10/10 VUs, 55 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  0m18.4s/1m0s

running (0m24.0s), 10/10 VUs, 59 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m19.4s/1m0s

running (0m25.0s), 10/10 VUs, 63 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  0m20.4s/1m0s

running (0m26.0s), 10/10 VUs, 65 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  0m21.4s/1m0s

running (0m27.0s), 10/10 VUs, 69 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  0m22.4s/1m0s

running (0m28.0s), 10/10 VUs, 72 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  0m23.4s/1m0s

running (0m29.0s), 10/10 VUs, 77 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  0m24.4s/1m0s

running (0m30.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  0m25.4s/1m0s

running (0m31.0s), 10/10 VUs, 83 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  0m26.4s/1m0s

running (0m32.0s), 10/10 VUs, 86 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  0m27.4s/1m0s

running (0m33.0s), 10/10 VUs, 86 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  0m28.4s/1m0s

running (0m34.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  0m29.4s/1m0s

running (0m35.0s), 10/10 VUs, 94 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  0m30.4s/1m0s

running (0m36.0s), 10/10 VUs, 99 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  0m31.4s/1m0s

running (0m37.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  0m32.4s/1m0s

running (0m38.0s), 10/10 VUs, 104 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  0m33.4s/1m0s

running (0m39.0s), 10/10 VUs, 105 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  0m34.4s/1m0s

running (0m40.0s), 10/10 VUs, 106 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  0m35.4s/1m0s

running (0m41.0s), 10/10 VUs, 106 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  0m36.4s/1m0s

running (0m42.0s), 10/10 VUs, 111 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  0m37.4s/1m0s

running (0m43.0s), 10/10 VUs, 114 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  0m38.4s/1m0s

running (0m44.0s), 10/10 VUs, 117 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  0m39.4s/1m0s

running (0m45.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  0m40.4s/1m0s

running (0m46.0s), 10/10 VUs, 124 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  0m41.4s/1m0s

running (0m47.0s), 10/10 VUs, 127 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  0m42.4s/1m0s

running (0m48.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  0m43.4s/1m0s

running (0m49.0s), 10/10 VUs, 133 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  0m44.4s/1m0s

running (0m50.0s), 10/10 VUs, 136 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  0m45.4s/1m0s

running (0m51.0s), 10/10 VUs, 138 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  0m46.4s/1m0s

running (0m52.0s), 10/10 VUs, 139 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  0m47.4s/1m0s

running (0m53.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  0m48.4s/1m0s

running (0m54.0s), 10/10 VUs, 142 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  0m49.4s/1m0s

running (0m55.0s), 10/10 VUs, 142 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  0m50.4s/1m0s

running (0m56.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  0m51.4s/1m0s

running (0m57.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  0m52.4s/1m0s

running (0m58.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  0m53.4s/1m0s

running (0m59.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  0m54.4s/1m0s

running (1m00.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  0m55.4s/1m0s

running (1m01.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  0m56.4s/1m0s

running (1m02.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  0m57.4s/1m0s

running (1m03.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  0m58.4s/1m0s

running (1m04.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  0m59.4s/1m0s

running (1m05.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m06.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m07.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m08.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m09.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m10.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m11.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m12.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m13.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m14.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m15.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m16.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m17.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m18.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m19.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m20.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m21.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m22.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m23.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m24.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m25.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m26.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m27.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m28.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m29.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m30.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m31.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m32.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m33.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s

running (1m34.0s), 10/10 VUs, 144 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  1m0s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<2000' p(95)=2.99s

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%

    match_found
    ✓ 'rate>0.3' rate=0.00%

    spin_success
    ✗ 'rate>0.95' rate=6.49%


  █ TOTAL RESULTS 

    checks_total.......: 308    3.255345/s
    checks_succeeded...: 53.24% 164 out of 308
    checks_failed......: 46.75% 144 out of 308

    ✓ spin status is 200
    ✗ spin response time < 1s
      ↳  6% — ✓ 10 / ✗ 144

    CUSTOM
    match_found....................: 0.00%  0 out of 0
    spin_success...................: 6.49%  10 out of 154
    spins_initiated................: 10     0.105693/s

    HTTP
    http_req_duration..............: avg=1.38s min=97.37ms med=1.27s max=5.37s p(90)=2.37s p(95)=2.99s
      { expected_response:true }...: avg=1.38s min=97.37ms med=1.27s max=5.37s p(90)=2.37s p(95)=2.99s
    http_req_failed................: 0.00%  0 out of 335
    http_reqs......................: 335    3.540716/s

    EXECUTION
    iteration_duration.............: avg=2.96s min=1.25s   med=2.87s max=7.09s p(90)=4.08s p(95)=4.84s
    iterations.....................: 144    1.521979/s
    vus............................: 10     min=0         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 134 kB 1.4 kB/s
    data_sent......................: 56 kB  596 B/s



running (1m34.6s), 00/10 VUs, 144 complete and 10 interrupted iterations
default ✓ [ 100% ] 10 VUs  1m0s
time="2025-12-07T11:07:40Z" level=error msg="thresholds on metrics 'http_req_duration, spin_success' have been crossed"